---

C#Visual BasicVisual C++

Revit 2024 API
---
ImportInstance..::..SetVisibility Method
ImportInstance Class See Also Send Feedback
---

Sets the visibility for the import instance in a family document.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)

# Syntax

C#
---

    public void SetVisibility(
    	FamilyElementVisibility visibility
    )

Visual Basic
---

    Public Sub SetVisibility ( _
    	visibility As FamilyElementVisibility _
    )

Visual C++
---

    public:
    void SetVisibility(
    	FamilyElementVisibility^ visibility
    )

#### Parameters

visibility
    Type: Autodesk.Revit.DB..::..FamilyElementVisibility

# Remarks

The visibility of the import instance geometry can be changed for different types of views and detail levels in the family document.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | Thrown when visibility is nullNothingnullptra null reference (Nothing in Visual Basic). |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when regeneration failed, or the import instance is in a project document. |

# See Also

ImportInstance Class

Autodesk.Revit.DB Namespace